{
  "backend/main.mo": "Main backend actor implementing user profiles with 6-character IDs, product/category management, shopping cart, payment configuration, queue skip submissions, custom username submissions, and access control with admin whitelist.",
  "backend/migration.mo": "Migration module that transforms old user profiles (with phone number fields) to new profiles (without phone number fields) by dropping phoneNumber, phoneNumberMap, and adminPhoneWhitelist.",
  "feature_evidence.json": "Feature evidence report documenting four completed features: phone number removal, ID claim dialog for 6-character IDs, frontend display updates, and phone number admin whitelist removal.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend components, pages, hooks, and configuration files describing their functionality and relationships.",
  "frontend/index.css": "Global Tailwind CSS styles with custom OKLCH color system variables for light and dark themes using neutral tones (no gaming colors mentioned in actual values).",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx, titled 'Digital Gaming Account Marketplace'.",
  "frontend/src/App.tsx": "Main app component orchestrating authentication flow with login queue, terms acceptance, ID claim dialog for 6-character IDs, AI username generator, and TanStack Router setup with theme provider.",
  "frontend/src/components/admin/CategoryForm.tsx": "Dialog form component for creating and editing product categories with name and description fields, using React Query mutations and toast notifications.",
  "frontend/src/components/admin/CategoryList.tsx": "Displays a table of categories with edit and delete actions, using shadcn/ui components. Includes a CategoryForm dialog for editing and an AlertDialog for delete confirmation.",
  "frontend/src/components/admin/CustomUsernameSubmissionsList.tsx": "Admin interface for reviewing custom username submissions with approve/reject actions, displaying user profiles, payment methods, and screenshot previews. Fetches user profiles for all submissions and handles status badges for pending, approved, and rejected states.",
  "frontend/src/components/admin/PaymentConfigForm.tsx": "Form for configuring payment details including PayPal email, gift card instructions, crypto wallet, Instagram URL, and pricing for queue skip, username regeneration, and custom usernames. Also includes functionality to add admin usernames.",
  "frontend/src/components/admin/ProductForm.tsx": "Dialog form for creating and updating products with fields for name, description, type, price, quantity, category, and image upload. Handles image file upload with progress tracking and uses ExternalBlob for image storage.",
  "frontend/src/components/admin/ProductList.tsx": "Displays a table of products with images, details, and edit/delete actions. Includes ProductForm dialog for editing and AlertDialog for delete confirmation.",
  "frontend/src/components/admin/QueueSkipSubmissionsList.tsx": "Admin component that displays a table of queue skip payment submissions with user details, timestamps, gift card types, and transaction info. Allows admins to flag submissions as fraudulent and shows status badges for pending, approved, or fraudulent submissions.",
  "frontend/src/components/admin/UsernameChangeSubmissionsList.tsx": "Admin component for reviewing username regeneration payment submissions, fetching user profiles for each submission and displaying them in a table. Provides functionality to flag fraudulent submissions and shows gift card types and payment statuses.",
  "frontend/src/components/auth/AIUsernameGenerator.tsx": "Component that automatically generates and validates unique gamer tags using an AI-based generator, retrying on duplicates until a valid username is found. Provides option to switch to custom username dialog and completes user onboarding upon successful username creation.",
  "frontend/src/components/auth/CustomUsernameDialog.tsx": "Multi-step dialog for purchasing custom usernames via PayPal, gift cards, or cryptocurrency, requiring payment proof upload and transaction details. After payment submission, allows users to input and validate their desired custom username before creation.",
  "frontend/src/components/auth/IdClaimDialog.tsx": "Dialog component that presents users with an auto-generated 6-character alphanumeric ID and allows them to either accept it or create a custom ID. Validates custom IDs for length and format, checking for duplicates before saving to the user profile.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states. Clears query cache on logout and handles authentication errors including duplicate session recovery.",
  "frontend/src/components/auth/LoginQueue.tsx": "Displays a queue screen with random wait times (20s-5min), progress bar, and social media links; includes a button to skip the queue for a fee via QueueSkipDialog.",
  "frontend/src/components/auth/PhoneNumberSetup.tsx": "Empty file with no content.",
  "frontend/src/components/auth/QueueSkipDialog.tsx": "Modal dialog showing payment methods (PayPal, UK gift cards, cryptocurrency) and a form to submit payment proof for skipping the queue.",
  "frontend/src/components/auth/QueueSkipPaymentForm.tsx": "Form component for submitting queue skip payment proof with support for PayPal, gift cards (with code entry), and crypto; validates inputs and handles file uploads for screenshots.",
  "frontend/src/components/auth/TermsAcceptanceModal.tsx": "Non-dismissible modal displaying terms and conditions stating no affiliation with hacking/scamming/third-party selling; requires user acceptance to proceed.",
  "frontend/src/components/auth/UsernameSetup.tsx": "Empty file with no content.",
  "frontend/src/components/auth/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name and email; saves profile data via backend mutation.",
  "frontend/src/components/cart/CartDrawer.tsx": "Side drawer component displaying shopping cart items with item count badge; shows empty state or scrollable list of CartItems with checkout button.",
  "frontend/src/components/cart/CartItem.tsx": "Displays individual cart item with product image, name, price, quantity controls (increment/decrement/input), and remove button; calculates and shows subtotal.",
  "frontend/src/components/checkout/PaymentMethodCard.tsx": "Reusable card component displaying payment method details (title, description, icon) with a copy-to-clipboard button for payment information.",
  "frontend/src/components/layout/Layout.tsx": "Main layout component with header navigation, authentication state, cart drawer, and username regeneration dialog. Displays admin panel link for admin users and shows current username with regeneration button.",
  "frontend/src/components/profile/UsernameRegenerationDialog.tsx": "Dialog for changing username with two options: AI-generated username regeneration and custom username selection. Displays payment methods (PayPal, gift cards, crypto) and pricing for each option.",
  "frontend/src/components/profile/UsernameRegenerationPaymentForm.tsx": "Payment submission form for username regeneration supporting PayPal, gift cards, and cryptocurrency. Handles transaction ID, screenshot uploads, gift card codes, and shows AI username generator upon successful payment.",
  "frontend/src/components/storefront/CategoryFilter.tsx": "Category filter component displaying buttons for product categories (account, currency, clothes) with icons and product counts. Allows filtering by category or showing all products.",
  "frontend/src/components/storefront/ProductCard.tsx": "Product card component displaying product image, name, description, price, stock quantity, and add-to-cart button. Shows out-of-stock badge and requires authentication to add items to cart.",
  "frontend/src/hooks/useActor.ts": "React Query hook for managing backend actor instances with authentication. Creates anonymous or authenticated actors based on identity state and initializes access control with admin token.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication. Manages login/logout flow, identity persistence, and authentication status with AuthClient integration.",
  "frontend/src/hooks/usePhoneNumber.ts": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API interactions including user profiles, usernames, products, categories, cart operations, payments, admin functions, and submission management (queue skips, username changes, custom usernames).",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using OKLCH color space, defining colors for backgrounds, foregrounds, borders, and chart elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page with role-based access control, displaying tabs for managing products, categories, payment config, queue skip submissions, username change submissions, and custom username submissions.",
  "frontend/src/pages/Checkout.tsx": "Checkout page displaying order summary with cart items and total, showing available payment methods (card, gift card, crypto) with instructions, and handling order completion.",
  "frontend/src/pages/Storefront.tsx": "Main storefront page with hero banner, category filtering, product grid display, social media links, and conditional admin panel access button for authenticated admin users.",
  "frontend/src/utils/gamerTagGenerator.ts": "Utility function that generates random gaming usernames by combining adjectives/nouns/action words with 2-digit numbers in formats like 'ShadowWarrior42' or 'TigerStrike89'.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, border radius variables, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document showing a social platform transitioning from phone number authentication to Internet Identity with 6-character user IDs, listing completed features and pending feature requests."
}