{
  "backend/main.mo": "Main backend actor implementing user profiles, product/category management, shopping cart, payment configuration, queue skip submissions, custom username submissions, and admin authorization with dual whitelist (username and phone number) using access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: worldwide phone number validation without prefix, 'Haven't Added Phone Number' button, and mandatory phone number requirement for all users on login.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including authentication flow, admin panels, storefront, checkout, and hooks with details on phone number setup, username generation, and dual whitelist authorization.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system using light/dark theme variables, avoiding blue and purple tones for gaming aesthetic.",
  "frontend/index.html": "HTML entry point with root div and module script import for the React application titled 'Digital Gaming Account Marketplace'.",
  "frontend/src/App.tsx": "Main app component orchestrating authentication flow with TanStack Router, managing login queue, terms acceptance, mandatory phone number setup for all users, AI username generation, and routing to storefront/admin/checkout pages.",
  "frontend/src/components/admin/CategoryForm.tsx": "Dialog form component for creating and editing categories with name and description fields, using React Query mutations and toast notifications.",
  "frontend/src/components/admin/CategoryList.tsx": "Displays a table of categories with edit and delete actions, using shadcn/ui components and react-query hooks. Includes an AlertDialog for delete confirmation and integrates with CategoryForm for editing.",
  "frontend/src/components/admin/CustomUsernameSubmissionsList.tsx": "Admin component that displays custom username submissions in a table with approve/reject actions, fetches usernames for each submission, and shows payment method badges and screenshot previews in a dialog.",
  "frontend/src/components/admin/PaymentConfigForm.tsx": "Form component for configuring payment details (PayPal, crypto, gift cards, Instagram URL) and pricing for queue skip, username regeneration, and custom usernames, with additional inputs for adding admin usernames and phone numbers.",
  "frontend/src/components/admin/ProductForm.tsx": "Dialog form for creating or updating products with fields for name, description, type, price, quantity, category, and image upload with progress tracking using ExternalBlob.",
  "frontend/src/components/admin/ProductList.tsx": "Displays a table of products with image thumbnails, type badges, and edit/delete actions, integrating with ProductForm for editing and an AlertDialog for delete confirmation.",
  "frontend/src/components/admin/QueueSkipSubmissionsList.tsx": "Admin component that displays a table of queue skip payment submissions with usernames, allowing admins to view details, flag fraudulent submissions, and see payment methods (PayPal, gift cards, or cryptocurrency). Includes dialogs for viewing screenshots and confirming fraud flags.",
  "frontend/src/components/admin/UsernameChangeSubmissionsList.tsx": "Admin component for reviewing username change payment submissions, displaying user principals, payment types, and statuses. Fetches usernames asynchronously for each submission and provides functionality to flag fraudulent submissions.",
  "frontend/src/components/auth/AIUsernameGenerator.tsx": "Component that automatically generates and validates unique gamer tags using a generator utility, retrying on duplicates until a valid username is found and created. Provides option to switch to custom username dialog.",
  "frontend/src/components/auth/CustomUsernameDialog.tsx": "Multi-step dialog for purchasing custom usernames, handling payment method selection (PayPal, gift cards, or crypto), payment proof submission with screenshots or gift card codes, and final username input with validation. Submits payment proof to backend for admin review.",
  "frontend/src/components/auth/LoginButton.tsx": "Simple authentication button component that toggles between login and logout states using Internet Identity, clearing the query cache on logout and handling authentication errors.",
  "frontend/src/components/auth/LoginQueue.tsx": "Queue waiting screen with video background that displays a countdown position (randomly initialized between 20 seconds and 5 minutes), progress bar, social media links, and a button to skip the queue for a fee.",
  "frontend/src/components/auth/PhoneNumberSetup.tsx": "Modal dialog that prompts users to add a phone number for account verification, with validation for digits-only input and error handling for duplicate numbers.",
  "frontend/src/components/auth/QueueSkipDialog.tsx": "Dialog displaying payment methods (PayPal, UK gift cards, cryptocurrency) for users to skip the queue by paying a fee, with a scrollable area containing payment method cards and a submission form.",
  "frontend/src/components/auth/QueueSkipPaymentForm.tsx": "Form component for submitting queue skip payment proof, supporting PayPal, gift card, and crypto payment methods with transaction ID, screenshot upload, and gift card code inputs.",
  "frontend/src/components/auth/TermsAcceptanceModal.tsx": "Non-dismissible modal displaying Game Vault's terms and conditions prohibiting hacking, scamming, and third-party selling, requiring user acceptance before account creation.",
  "frontend/src/components/auth/UsernameSetup.tsx": "Empty file with no content.",
  "frontend/src/components/auth/UserProfileSetup.tsx": "Modal dialog that appears for authenticated users without a profile, prompting them to enter their name and email to complete profile setup.",
  "frontend/src/components/cart/CartDrawer.tsx": "Side sheet drawer displaying shopping cart items with item count badge, scrollable cart items list, and checkout button.",
  "frontend/src/components/cart/CartItem.tsx": "Cart item component displaying product image, name, price, and quantity controls with increment/decrement buttons and remove functionality.",
  "frontend/src/components/checkout/PaymentMethodCard.tsx": "Card component displaying a payment method with icon, title, description, and copyable payment details with visual feedback.",
  "frontend/src/components/layout/Layout.tsx": "Main layout component with header navigation (store/admin links), authentication status, username display with regeneration button, cart drawer, and footer. Conditionally renders UserProfileSetup and UsernameRegenerationDialog based on authentication state.",
  "frontend/src/components/profile/UsernameRegenerationDialog.tsx": "Dialog for changing usernames with two options: AI-generated username regeneration (£0.01) and custom username (£0.10). Displays payment methods (PayPal, UK gift cards, cryptocurrency) and includes payment form submission.",
  "frontend/src/components/profile/UsernameRegenerationPaymentForm.tsx": "Form for submitting payment proof for username regeneration, supporting PayPal, gift cards, and cryptocurrency. Handles transaction ID, screenshot uploads, gift card codes, and shows AIUsernameGenerator on successful payment submission.",
  "frontend/src/components/storefront/CategoryFilter.tsx": "Category filter component displaying buttons for all products and individual categories (account, currency, clothes) with icons and product counts. Manages selected category state.",
  "frontend/src/components/storefront/ProductCard.tsx": "Product card component displaying product image, name, description, price, stock quantity, and add-to-cart button. Handles out-of-stock state and requires authentication to add items to cart.",
  "frontend/src/hooks/useActor.ts": "React Query hook for managing backend actor instance with authentication. Creates anonymous or authenticated actor based on identity, initializes access control with admin token, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication using DFINITY AuthClient. Manages login state, identity persistence, and provides login/logout functions with configurable options for idle handling and derivation origin.",
  "frontend/src/hooks/usePhoneNumber.ts": "Provides React hooks for checking if a user has a phone number and saving a phone number with validation (strips non-digits, rejects + prefix).",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, usernames, products, categories, cart, orders, payment config, queue skip submissions, custom usernames, and admin operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components using HSL values.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page with tabs for managing products, categories, payment config, queue skip submissions, username changes, and custom usernames; restricts access to admin role.",
  "frontend/src/pages/Checkout.tsx": "Checkout page displaying order summary and payment methods (card, gift card, crypto); allows users to complete orders and clear cart.",
  "frontend/src/pages/Storefront.tsx": "Main storefront page with hero banner, category filtering, product grid, and social media links; includes admin panel access button for authorized users.",
  "frontend/src/utils/gamerTagGenerator.ts": "Utility function that generates random gaming usernames by combining adjectives/nouns/action words with two-digit numbers (e.g., ShadowWarrior42).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, custom animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing a digital gaming marketplace with admin-managed product listings, Internet Identity authentication, multiple payment methods, AI-generated usernames, and phone number requirements; currently tracking admin panel access and data loading issues."
}