{
  "backend/main.mo": "Main backend actor implementing user profiles with AI-generated and custom usernames, product/category management, shopping cart, payment configuration, queue skip submissions with fraud detection, custom username submissions with admin approval, and admin username whitelist functionality.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence features for updating admin submission lists (QueueSkip, UsernameChange, CustomUsername) to display usernames instead of principal IDs, and verifying the useProfile query hook correctly handles username precedence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including authentication flow, storefront, admin panel, cart, checkout, and query hooks with username handling logic.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark theme variables using grayscale tones with minimal color saturation.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the React application titled 'Digital Gaming Account Marketplace'.",
  "frontend/src/App.tsx": "Root application component orchestrating TanStack Router, authentication flow with login queue, terms acceptance, AI username generation, and main route rendering with state management for user onboarding.",
  "frontend/src/components/admin/CategoryForm.tsx": "Dialog form component for creating and editing categories with name and description fields, using React Query mutations and toast notifications.",
  "frontend/src/components/admin/CategoryList.tsx": "Displays a table of categories with edit and delete actions, using shadcn/ui components and React Query hooks. Includes an AlertDialog for delete confirmation and integrates with CategoryForm for editing.",
  "frontend/src/components/admin/CustomUsernameSubmissionsList.tsx": "Admin component that displays custom username submissions in a table with approve/reject actions and screenshot viewing. Fetches and displays usernames for each submission, showing status badges and payment method information.",
  "frontend/src/components/admin/PaymentConfigForm.tsx": "Form component for configuring payment methods (PayPal, crypto, gift cards) and pricing for queue skip, username regeneration, and custom usernames. Uses React Query to fetch and update payment details with validation.",
  "frontend/src/components/admin/ProductForm.tsx": "Dialog form for creating and editing products with fields for name, description, type, price, quantity, category, and image upload. Handles image file uploads with progress tracking and uses ExternalBlob for image storage.",
  "frontend/src/components/admin/ProductList.tsx": "Displays a table of products with images, details, and edit/delete actions. Includes delete confirmation dialog and integrates with ProductForm for product management.",
  "frontend/src/components/admin/QueueSkipSubmissionsList.tsx": "Admin component that displays a table of queue skip payment submissions with usernames, allowing admins to view details, flag fraudulent submissions, and see payment methods (PayPal, gift cards, or cryptocurrency). Includes dialogs for viewing screenshots and confirming fraud flags.",
  "frontend/src/components/admin/UsernameChangeSubmissionsList.tsx": "Admin component for reviewing username change payment submissions, displaying user principals, payment types, and statuses. Fetches usernames asynchronously for each submission and provides functionality to flag submissions as fraudulent.",
  "frontend/src/components/auth/AIUsernameGenerator.tsx": "Component that automatically generates and validates unique gamer tags using a generator utility, retrying on duplicates until a valid username is found. Provides option to switch to custom username dialog.",
  "frontend/src/components/auth/CustomUsernameDialog.tsx": "Multi-step dialog for purchasing custom usernames, handling payment method selection (PayPal, gift cards, or crypto), payment proof submission with screenshots or gift card codes, and final username input with validation. Supports UK gift cards and displays hardcoded crypto address.",
  "frontend/src/components/auth/LoginButton.tsx": "Simple authentication button component that toggles between login and logout states using Internet Identity, clearing the query cache on logout and handling authentication errors.",
  "frontend/src/components/auth/LoginQueue.tsx": "Queue waiting screen with video background that displays a countdown position (randomly initialized between 20 seconds and 5 minutes), progress bar, social media links, and a button to skip the queue for a fee.",
  "frontend/src/components/auth/QueueSkipDialog.tsx": "Dialog component that displays payment methods (PayPal, UK Gift Card, Cryptocurrency) and a form for users to submit payment proof to skip the queue for a configurable price.",
  "frontend/src/components/auth/QueueSkipPaymentForm.tsx": "Form component for submitting queue skip payment proof with support for PayPal, gift cards, and cryptocurrency, including transaction ID, screenshot upload, and gift card code validation.",
  "frontend/src/components/auth/TermsAcceptanceModal.tsx": "Modal dialog that displays terms and conditions prohibiting hacking, scamming, and third-party selling, requiring user acceptance before account creation.",
  "frontend/src/components/auth/UsernameSetup.tsx": "Empty file with no content.",
  "frontend/src/components/auth/UserProfileSetup.tsx": "Dialog component that prompts authenticated users without a profile to enter their name and email during initial setup.",
  "frontend/src/components/cart/CartDrawer.tsx": "Side sheet drawer component that displays cart items with item count badge and checkout button, showing empty state when cart is empty.",
  "frontend/src/components/cart/CartItem.tsx": "Cart item component displaying product image, name, price, and quantity controls with increment/decrement buttons and remove functionality.",
  "frontend/src/components/checkout/PaymentMethodCard.tsx": "Card component that displays payment method details with an icon, description, and copy-to-clipboard button for payment information.",
  "frontend/src/components/layout/Layout.tsx": "Main layout component with header navigation, footer, and authenticated user features including cart drawer, username display with regeneration button, and admin panel link for admin users.",
  "frontend/src/components/profile/UsernameRegenerationDialog.tsx": "Dialog component for changing usernames with two options: AI-generated username regeneration (£0.01) and custom username selection (£0.10), displaying payment methods (PayPal, gift cards, crypto) and handling payment submission flows.",
  "frontend/src/components/profile/UsernameRegenerationPaymentForm.tsx": "Form component for submitting username regeneration payment proof supporting PayPal, gift cards, and cryptocurrency, with file upload for screenshots and gift card code entry, then showing AI username generator upon successful submission.",
  "frontend/src/components/storefront/CategoryFilter.tsx": "Filter component displaying category buttons (account, currency, clothes) with icons and product counts, allowing users to filter products by category or view all products.",
  "frontend/src/components/storefront/ProductCard.tsx": "Card component displaying individual product details (image, name, description, price, quantity) with an 'Add to Cart' button that requires authentication and handles out-of-stock states.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing with admin token and invalidating dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient creation with configurable options for idle handling and derivation origin.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend API calls including user profiles, usernames, roles, products, categories, cart operations, orders, payments, and admin functions with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space, including primary, secondary, accent, destructive, muted colors and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with role-based access control that displays tabs for managing products, categories, payment config, queue skip submissions, username change submissions, and custom username submissions.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that displays cart items with order summary, payment method options (card, gift card, crypto), and handles order completion by clearing the cart.",
  "frontend/src/pages/Storefront.tsx": "Main storefront page displaying hero banner, product grid with category filtering, product counts per category, and conditional admin panel access button for authenticated admin users.",
  "frontend/src/utils/gamerTagGenerator.ts": "Utility function that generates random gaming usernames by combining adjectives/nouns/action words with 2-digit numbers in formats like 'ShadowWarrior42' or 'TigerStrike89'.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from both regular and hash-based routing, with sessionStorage persistence support and functions to store, retrieve, and clear parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for colors using OKLCH variables, container settings, border radius variables, custom animations for accordions, and typography/container-queries/animate plugins.",
  "project_state.json": "Project state tracking file for a digital gaming marketplace with admin-managed product listings, Internet Identity authentication, and multi-payment support. Currently tracking known issues with admin panel access and data loading, plus existing features for authentication, product management, cart, checkout, and AI-generated usernames."
}