{
  "backend/main.mo": "Main backend actor implementing user profiles, product/category management, shopping cart, payment configuration, and order processing with role-based access control using authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (authentication, admin panel, storefront, cart, checkout, payment config) to their corresponding files, components, and test IDs with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components for authentication, cart, storefront, admin panel, checkout, and custom hooks with React Query integration.",
  "frontend/index.css": "Global Tailwind CSS styles with custom OKLCH color system variables for light and dark themes, using neutral grayscale tones without blue or purple.",
  "frontend/index.html": "HTML entry point for the Digital Gaming Account Marketplace application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for storefront, admin panel, and checkout, wrapped in ThemeProvider with dark mode default and Toaster for notifications.",
  "frontend/src/components/admin/CategoryForm.tsx": "Dialog form component for creating and editing categories with name and description fields, using React Query mutations and toast notifications.",
  "frontend/src/components/admin/CategoryList.tsx": "Table component displaying all categories with edit and delete actions, confirmation dialogs, and integration with CategoryForm for editing.",
  "frontend/src/components/admin/PaymentConfigForm.tsx": "Admin form component for configuring payment methods (PayPal, UK gift cards, crypto wallet). Fetches existing payment details and allows updating them with validation and loading states.",
  "frontend/src/components/admin/ProductForm.tsx": "Dialog form component for creating and editing products with fields for name, description, type, price, quantity, category, and image upload. Handles image file uploads with progress tracking and supports both create and update operations.",
  "frontend/src/components/admin/ProductList.tsx": "Admin table component displaying all products with image, name, type, category, price, and quantity. Provides edit and delete actions with confirmation dialog.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component using Internet Identity that toggles between login and logout states. Handles authentication errors and clears query cache on logout.",
  "frontend/src/components/auth/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name and email. Appears automatically after login if no profile exists and cannot be dismissed.",
  "frontend/src/components/cart/CartDrawer.tsx": "Slide-out drawer component displaying shopping cart items with item count badge. Shows empty state or scrollable cart items with checkout button.",
  "frontend/src/components/cart/CartItem.tsx": "Individual cart item component showing product image, name, price, and quantity controls. Allows incrementing, decrementing, manual quantity input, and removal with optimistic UI updates.",
  "frontend/src/components/checkout/PaymentMethodCard.tsx": "Card component displaying a single payment method with title, description, and copyable payment details. Includes copy-to-clipboard functionality with visual feedback.",
  "frontend/src/components/layout/Layout.tsx": "Main layout component with header navigation (logo, store/admin links, cart, login), footer with branding, and wraps children content. Conditionally shows admin panel link and cart drawer based on user authentication and role.",
  "frontend/src/components/storefront/CategoryFilter.tsx": "Category filter component that displays buttons for all categories with icons and product counts. Allows selecting a category or viewing all products with visual indication of active selection.",
  "frontend/src/components/storefront/ProductCard.tsx": "Product card component displaying product image, name, description, price, stock quantity, and add-to-cart button. Handles out-of-stock states and requires authentication to add items to cart.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and auth client lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including user profiles, products, categories, cart management, orders, and payment configuration with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including primary, secondary, accent, and chart colors using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page with tabs for managing products, categories, and payment settings. Includes role-based access control that restricts access to admin users only.",
  "frontend/src/pages/Checkout.tsx": "Checkout page component that displays order summary with cart items and total, shows payment method instructions (PayPal, gift cards, crypto), and allows authenticated users to complete orders by clearing the cart.",
  "frontend/src/pages/Storefront.tsx": "Main storefront page with hero banner, category filter, and product grid that displays all products or filters by selected game category with product counts.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH color space), container settings, border radius variables, font families, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata defining a gaming marketplace with Motoko backend, React frontend, Internet Identity authentication, admin-managed products, manual payment processing, and multi-category product organization."
}