{
  "backend/main.mo": "Main actor implementing user profiles with username creation (validation, profanity filtering, uniqueness checks), access control integration, and blob storage mixins for a gaming marketplace backend.",
  "backend/migration.mo": "Migration module that adds an instagramUrl field to the payment configuration while preserving existing user profiles, products, categories, and cart data.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: animated video background for login queue, YouTube/Instagram social links on queue and storefront pages, and Instagram URL configuration in admin panel.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components including authentication flow, storefront, admin panel, cart, checkout, and social media integration features.",
  "frontend/index.css": "Global Tailwind CSS styles with custom OKLCH color system variables for light and dark themes, using neutral tones with accent colors for a gaming aesthetic.",
  "frontend/index.html": "HTML entry point for the Digital Gaming Account Marketplace React application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component orchestrating TanStack Router, authentication flow with login queue and username setup gates, and theme provider wrapping the main layout and routes.",
  "frontend/src/components/admin/CategoryForm.tsx": "Dialog form component for creating and editing product categories with name and description fields, using React Query mutations and toast notifications.",
  "frontend/src/components/admin/CategoryList.tsx": "Displays a table of categories with edit and delete actions, using React Query hooks for data fetching and mutations. Includes a confirmation dialog for deletions and integrates with CategoryForm for editing.",
  "frontend/src/components/admin/PaymentConfigForm.tsx": "Form component for configuring payment methods (PayPal, UK gift cards, crypto wallet, Instagram URL) with validation and persistence using React Query mutations. Loads existing payment details on mount and validates Instagram URL format.",
  "frontend/src/components/admin/ProductForm.tsx": "Dialog-based form for creating and updating products with fields for name, description, type, price, quantity, category, and image upload. Handles image file conversion to ExternalBlob with upload progress tracking.",
  "frontend/src/components/admin/ProductList.tsx": "Displays a table of products with thumbnails, details, and edit/delete actions. Integrates with ProductForm for editing and shows confirmation dialog before deletion.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component that toggles between login and logout states using Internet Identity authentication. Clears query cache on logout and handles authentication errors.",
  "frontend/src/components/auth/LoginQueue.tsx": "Queue screen with video background that displays a countdown timer (random 20s-5min) before allowing access, with social media links to YouTube and Instagram. Progress bar shows queue position advancement.",
  "frontend/src/components/auth/UsernameSetup.tsx": "Modal dialog for creating a unique username with client-side and backend validation (min 5 chars, lowercase alphanumeric only, no forbidden words). Calls onComplete callback after successful creation.",
  "frontend/src/components/auth/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name and email. Blocks interaction until profile is saved.",
  "frontend/src/components/cart/CartDrawer.tsx": "Side sheet drawer displaying cart items with item count badge, scrollable list of CartItem components, and checkout button. Shows empty state when cart is empty.",
  "frontend/src/components/cart/CartItem.tsx": "Displays individual cart item with product image, name, price, quantity controls (increment/decrement/input), remove button, and calculated subtotal.",
  "frontend/src/components/checkout/PaymentMethodCard.tsx": "Card component displaying payment method details (title, description, payment address/info) with a copy-to-clipboard button and toast notification.",
  "frontend/src/components/layout/Layout.tsx": "Main layout wrapper with sticky header (logo, navigation links, cart drawer, login button), main content area, footer with Caffeine.ai attribution, and UserProfileSetup modal. Shows admin link for admin users.",
  "frontend/src/components/storefront/CategoryFilter.tsx": "Horizontal filter bar with buttons for each product category (with icons and product counts) plus an 'All Products' option. Highlights selected category.",
  "frontend/src/components/storefront/ProductCard.tsx": "Product card displaying image, name, description, price, stock quantity, product type badge, and add-to-cart button. Shows out-of-stock overlay when unavailable.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token from URL params and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, products, categories, cart management, and payment configuration with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using HSL color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page with role-based access control, featuring tabbed interface for managing products, categories, and payment settings.",
  "frontend/src/pages/Checkout.tsx": "Checkout page displaying order summary with cart items and total, payment method options, and order completion functionality that clears the cart.",
  "frontend/src/pages/Storefront.tsx": "Main storefront page with hero banner, category filtering, and product grid display with loading states and social media links.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings for borders/radius/animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing a digital gaming marketplace with Motoko backend, React frontend, Internet Identity authentication, admin-managed product listings, manual payment processing (PayPal/gift cards/crypto), and username system with login queue."
}