{
  "backend/main.mo": "Main backend actor implementing user profiles, product catalog, shopping cart, payment configuration, queue skip system, custom username submissions with admin whitelist, and access control using mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting two features: updating the useProfile query hook to fetch custom username field, and updating the Storefront component to display custom username when available.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including authentication flow, storefront, admin panel, cart, checkout, and hooks with specific notes about custom username handling and display logic.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark theme variables for a gaming aesthetic using neutral tones without blue or purple.",
  "frontend/index.html": "HTML entry point for the Digital Gaming Account Marketplace application with root div and module script reference.",
  "frontend/src/App.tsx": "Main app component orchestrating TanStack Router, authentication flow with login queue, terms acceptance, AI username generator, and conditional rendering based on user state with routes for storefront, admin, and checkout.",
  "frontend/src/components/admin/CategoryForm.tsx": "Dialog form component for creating and editing product categories with name and description fields, using React Query mutations and toast notifications.",
  "frontend/src/components/admin/CategoryList.tsx": "Admin table component displaying all categories with edit and delete actions, confirmation dialog for deletion, and integration with CategoryForm for editing.",
  "frontend/src/components/admin/CustomUsernameSubmissionsList.tsx": "Admin component for reviewing custom username payment submissions with approve/reject actions, screenshot viewing, and status badges for PayPal, crypto, and gift card payments.",
  "frontend/src/components/admin/PaymentConfigForm.tsx": "Admin form component for configuring payment methods (PayPal, gift cards, crypto) and pricing for queue skip, username regeneration, and custom username features.",
  "frontend/src/components/admin/ProductForm.tsx": "Dialog form component for creating and updating products with fields for name, description, type, price, quantity, category, and image upload with progress tracking.",
  "frontend/src/components/admin/ProductList.tsx": "Admin component displaying a table of all products with edit and delete actions, showing product images, details, pricing, and inventory quantities.",
  "frontend/src/components/admin/QueueSkipSubmissionsList.tsx": "Admin component for reviewing queue skip payment submissions (PayPal, gift cards, crypto) with fraud flagging capability and status badges, sorted by most recent first.",
  "frontend/src/components/admin/UsernameChangeSubmissionsList.tsx": "Admin component that displays a table of username change payment submissions with status badges, gift card details, and actions to flag fraudulent submissions. Includes helper functions to format principals, gift card types, and submission statuses.",
  "frontend/src/components/auth/AIUsernameGenerator.tsx": "Component that automatically generates and validates unique gamer tags using AI, retrying on duplicates until a valid username is found. Provides option to switch to custom username dialog and displays animated loading state during generation.",
  "frontend/src/components/auth/CustomUsernameDialog.tsx": "Multi-step dialog for users to purchase custom usernames by selecting payment method (PayPal, gift card, or crypto), uploading payment proof with transaction details, and entering their desired username with validation. Handles file uploads and submission of payment proofs to backend.",
  "frontend/src/components/auth/LoginButton.tsx": "Simple authentication button component that toggles between login and logout states using Internet Identity, with loading states and error handling for authentication flow.",
  "frontend/src/components/auth/LoginQueue.tsx": "Queue waiting screen with video background that displays a random countdown position (20s-5min) with progress bar, social media links, and option to skip queue for a fee. Automatically completes when countdown reaches zero.",
  "frontend/src/components/auth/QueueSkipDialog.tsx": "Dialog component that displays payment method options (PayPal, UK gift cards, cryptocurrency) for skipping the login queue and contains the payment proof submission form. Shows pricing and payment details in a scrollable layout.",
  "frontend/src/components/auth/QueueSkipPaymentForm.tsx": "Form component for submitting queue-skip payment proof supporting PayPal, UK gift cards (Amazon, Tesco, Starbucks), and cryptocurrency. Validates transaction IDs, gift card codes, and screenshot uploads with file size/type checks.",
  "frontend/src/components/auth/TermsAcceptanceModal.tsx": "Modal dialog displaying terms and conditions that users must accept before account creation. Emphasizes prohibition of hacking, scamming, and third-party selling with non-dismissible UI.",
  "frontend/src/components/auth/UsernameSetup.tsx": "Empty file with no content.",
  "frontend/src/components/auth/UserProfileSetup.tsx": "Modal dialog for new users to set up their profile with name and email fields. Appears automatically after authentication if no profile exists.",
  "frontend/src/components/cart/CartDrawer.tsx": "Side drawer component displaying shopping cart items with item count badge. Provides navigation to checkout and shows empty state when cart is empty.",
  "frontend/src/components/cart/CartItem.tsx": "Individual cart item component with product image, quantity controls (increment/decrement), and remove button. Calculates and displays subtotal for each item.",
  "frontend/src/components/checkout/PaymentMethodCard.tsx": "Reusable card component displaying payment method details with copy-to-clipboard functionality. Shows title, description, payment details in monospace font, and copy button with success feedback.",
  "frontend/src/components/layout/Layout.tsx": "Main application layout with sticky header containing logo, navigation (Store, Admin Panel), username display with regeneration button, cart drawer, and login button. Includes footer with copyright and Caffeine.ai attribution, plus UserProfileSetup modal.",
  "frontend/src/components/profile/UsernameRegenerationDialog.tsx": "Dialog component for changing usernames with two options: AI-generated username regeneration (£0.01) and custom username selection (£0.10), displaying payment methods (PayPal, gift cards, cryptocurrency) and handling payment submission flows.",
  "frontend/src/components/profile/UsernameRegenerationPaymentForm.tsx": "Payment form component for username regeneration that handles multiple payment methods (PayPal, gift cards, crypto), collects transaction IDs and screenshots, and shows an AI username generator upon successful payment submission.",
  "frontend/src/components/storefront/CategoryFilter.tsx": "Filter component displaying category buttons (account, currency, clothes) with icons and product counts, allowing users to filter products by category or view all products.",
  "frontend/src/components/storefront/ProductCard.tsx": "Product card component displaying product image, name, description, price, availability, and an add-to-cart button with authentication checks and out-of-stock handling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and providing login/logout functionality with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend API calls including user profiles, usernames, products, categories, cart operations, payments, and admin functions with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space, including primary, secondary, accent, destructive, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with role-based access control that displays tabs for managing products, categories, payment config, queue skip submissions, username changes, and custom usernames. Shows access denied message for non-admin users.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that displays cart summary with product details and total, shows available payment methods (card, gift card, crypto), and handles order completion by clearing the cart.",
  "frontend/src/pages/Storefront.tsx": "Main storefront page with hero banner, category filtering, product grid display, and social media links. Includes admin panel access button for authenticated admin users.",
  "frontend/src/utils/gamerTagGenerator.ts": "Utility function that generates random gaming usernames by combining adjectives/nouns/action words with a 2-digit number suffix (e.g., ShadowWarrior42).",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from both regular and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for colors using OKLCH variables, container settings, border radius, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file for a digital gaming marketplace with admin-managed product listings, Internet Identity authentication, and manual payment processing. Includes architectural notes, existing features (authentication, admin panel, storefront, cart, checkout, payment config, categories, orders, login queue, social links, AI username generation), and current fix request to add Instagram link to queue page."
}