{
  "backend/main.mo": "Main backend actor implementing user profiles, product catalog, shopping cart, payment configuration, queue skip system, custom username submissions, and admin username whitelist with authorization checks.",
  "feature_evidence.json": "Feature evidence report documenting the admin authorization check update to verify whitelisted usernames ('venomgladiator25' and 'turbohunter64') against authenticated users for admin panel access.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including the Storefront page with useIsAdminUsername query hook and useQueries.ts hooks for backend operations.",
  "frontend/index.css": "Global CSS with Tailwind directives and custom CSS variables for light and dark themes using OKLCH color system with neutral grayscale tones.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the React application titled 'Digital Gaming Account Marketplace'.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup, authentication flow orchestration including login queue, terms acceptance, AI username generator, and conditional rendering based on user state.",
  "frontend/src/components/admin/CategoryForm.tsx": "Dialog form component for creating and editing categories with name and description fields, using React Query mutations and toast notifications.",
  "frontend/src/components/admin/CategoryList.tsx": "Table component displaying all categories with edit and delete actions, confirmation dialogs, and integration with CategoryForm for editing.",
  "frontend/src/components/admin/CustomUsernameSubmissionsList.tsx": "Admin component for reviewing custom username payment submissions with approve/reject actions, screenshot viewing, and status badges for PayPal, crypto, and gift card payments.",
  "frontend/src/components/admin/PaymentConfigForm.tsx": "Admin form component for configuring payment methods (PayPal, gift cards, crypto wallet) and pricing for queue skip, username regeneration, and custom username features.",
  "frontend/src/components/admin/ProductForm.tsx": "Dialog form component for creating and updating products with fields for name, description, type, price, quantity, category, and image upload with progress tracking.",
  "frontend/src/components/admin/ProductList.tsx": "Admin component displaying a table of all products with edit and delete actions, showing product images, type, category, price, and quantity.",
  "frontend/src/components/admin/QueueSkipSubmissionsList.tsx": "Admin component for reviewing queue skip payment submissions (PayPal, gift cards, crypto) with fraud flagging capability and status badges, sorted by most recent first.",
  "frontend/src/components/admin/UsernameChangeSubmissionsList.tsx": "Admin component that displays a table of username change payment submissions with details like user principal, payment method, gift card info, and status badges. Provides functionality to flag submissions as fraudulent and formats timestamps and principals for display.",
  "frontend/src/components/auth/AIUsernameGenerator.tsx": "Component that automatically generates and validates unique gamer tags using a generator utility, retrying on duplicates until a valid username is found. Displays an animated dialog with the current username being validated and offers an option to switch to custom username entry.",
  "frontend/src/components/auth/CustomUsernameDialog.tsx": "Multi-step dialog for users to purchase a custom username by selecting a payment method (PayPal, UK gift card, or crypto), uploading payment proof with transaction details, and then entering their desired username. Validates username format (5+ alphanumeric characters) and submits payment proof with screenshot or gift card code.",
  "frontend/src/components/auth/LoginButton.tsx": "Simple authentication button component that toggles between login and logout states using Internet Identity. Handles login errors, clears query cache on logout, and displays loading state during authentication.",
  "frontend/src/components/auth/LoginQueue.tsx": "Queue waiting screen with video background that displays a countdown position (randomly initialized between 20 seconds and 5 minutes) and progress bar. Includes social media links and a button to open the queue skip payment dialog.",
  "frontend/src/components/auth/QueueSkipDialog.tsx": "Dialog component that displays available payment methods (PayPal, UK gift cards, cryptocurrency) for skipping the login queue and embeds the QueueSkipPaymentForm for submitting payment proof. Shows payment details and pricing fetched from backend.",
  "frontend/src/components/auth/QueueSkipPaymentForm.tsx": "Form component for submitting queue-skip payment proof, supporting PayPal, UK gift cards (Amazon, Tesco, Starbucks), and cryptocurrency payment methods with transaction ID, screenshot upload, and gift card code validation.",
  "frontend/src/components/auth/TermsAcceptanceModal.tsx": "Modal dialog that displays terms and conditions stating Game Vault's policy against hacking, scamming, and third-party selling, requiring user acceptance before account creation.",
  "frontend/src/components/auth/UsernameSetup.tsx": "Empty file with no content.",
  "frontend/src/components/auth/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name and email, blocking interaction until profile setup is complete.",
  "frontend/src/components/cart/CartDrawer.tsx": "Side sheet drawer component displaying shopping cart items with item count badge, scrollable list, and checkout button navigation.",
  "frontend/src/components/cart/CartItem.tsx": "Cart item component displaying product image, name, price, and quantity controls with increment/decrement buttons and remove functionality.",
  "frontend/src/components/checkout/PaymentMethodCard.tsx": "Card component displaying payment method details (title, description, payment address/ID) with a copy-to-clipboard button for the payment details.",
  "frontend/src/components/layout/Layout.tsx": "Main layout wrapper with sticky header containing logo, navigation links (Store, Admin Panel), username display with regeneration button, cart drawer, login button, and footer with Caffeine.ai attribution.",
  "frontend/src/components/profile/UsernameRegenerationDialog.tsx": "Dialog component for changing usernames, offering AI-generated usernames for a fee or custom usernames at a higher price. Displays payment methods (PayPal, gift cards, cryptocurrency) and integrates payment forms and custom username dialogs.",
  "frontend/src/components/profile/UsernameRegenerationPaymentForm.tsx": "Form component for submitting payment proof for username regeneration, supporting PayPal, gift cards, and cryptocurrency payment methods. After successful payment submission, displays an AI username generator component.",
  "frontend/src/components/storefront/CategoryFilter.tsx": "Filter component displaying category buttons with icons and product counts. Allows users to filter products by category or view all products.",
  "frontend/src/components/storefront/ProductCard.tsx": "Card component displaying individual product details including image, name, description, price, and stock availability. Includes add-to-cart functionality with authentication checks.",
  "frontend/src/hooks/useActor.ts": "Custom hook managing the backend actor instance with authentication support. Creates authenticated or anonymous actors based on identity state and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and providing authentication methods. Handles AuthClient creation with configurable options and delegation identity management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend API calls including user profiles, usernames, products, categories, cart operations, and payment submissions. Provides both query and mutation hooks with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space, including primary, secondary, accent, destructive, muted, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with role-based access control that displays tabs for managing products, categories, payment config, queue skip submissions, username changes, and custom usernames. Shows access denied message for non-admin users.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that displays cart items with order summary, payment method options (card, gift card, crypto), and handles order completion by clearing the cart and redirecting to home.",
  "frontend/src/pages/Storefront.tsx": "Main storefront page with hero banner, category filtering, product grid display, and admin panel access button for authenticated admin users. Includes social media links and loading states.",
  "frontend/src/utils/gamerTagGenerator.ts": "Utility function that generates random gaming-themed usernames by combining adjectives/nouns/action words with 2-digit numbers in formats like 'ShadowWarrior42' or 'TigerStrike89'.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from both regular and hash-based routing, with sessionStorage persistence support and functions to store, retrieve, and clear parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for colors using OKLCH variables, container settings, border radius, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file for a digital gaming marketplace with 25 versions, documenting existing features including Internet Identity authentication, admin product management, multi-payment checkout (PayPal, gift cards, crypto), and AI-generated GamerTag usernames. Current fix request involves implementing a login queue with random 20-60s countdown and social media links (YouTube/Instagram) on queue and store pages."
}