{
  "backend/main.mo": "Main backend actor implementing a digital gaming marketplace with user profiles, products, categories, shopping cart, payment configuration, queue skip system, custom username submissions, and admin authorization using mixins for storage and access control.",
  "backend/migration.mo": "Migration module that clones the adminUsernameWhitelist and adds two specific usernames ('venomgladiator25' and 'turbohunter64') to the whitelist during upgrade.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend components including authentication flow, storefront, admin panel, cart, checkout, and various UI components with their specific functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space with neutral grayscale tones.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Digital Gaming Account Marketplace', and root div mounting the React app from main.tsx.",
  "frontend/src/App.tsx": "Root application component orchestrating TanStack Router with authentication flow including login queue, queue bypass checking, terms acceptance modal, AI username generator, and routing to storefront, admin panel, and checkout pages.",
  "frontend/src/components/admin/CategoryForm.tsx": "Dialog form component for creating and editing categories with name and description fields, using React Query mutations and toast notifications.",
  "frontend/src/components/admin/CategoryList.tsx": "Table component displaying all categories with edit and delete actions, confirmation dialog for deletion, and integration with CategoryForm for editing.",
  "frontend/src/components/admin/CustomUsernameSubmissionsList.tsx": "Displays a table of custom username payment submissions with approve/reject actions and screenshot viewing. Includes status badges, payment method indicators, and transaction detail extraction.",
  "frontend/src/components/admin/PaymentConfigForm.tsx": "Form component for configuring payment methods (PayPal, crypto, gift cards) and pricing for queue skip, username regeneration, and custom usernames. Validates and updates payment configuration via API.",
  "frontend/src/components/admin/ProductForm.tsx": "Dialog form for creating or editing products with fields for name, description, type, price, quantity, category, and image upload. Handles image upload progress and ExternalBlob conversion.",
  "frontend/src/components/admin/ProductList.tsx": "Table view of all products with edit and delete actions. Displays product images, details, and opens ProductForm dialog for editing.",
  "frontend/src/components/admin/QueueSkipSubmissionsList.tsx": "Admin interface for reviewing queue skip payment submissions with fraud flagging capability. Shows payment method, gift card types, status badges, and sorted submission history.",
  "frontend/src/components/admin/UsernameChangeSubmissionsList.tsx": "Admin component that displays a table of username change payment submissions with status badges, gift card details, and actions to flag fraudulent submissions.",
  "frontend/src/components/auth/AIUsernameGenerator.tsx": "Component that automatically generates and validates unique gamer tags using AI, retrying on duplicates, with an option to switch to custom username entry.",
  "frontend/src/components/auth/CustomUsernameDialog.tsx": "Multi-step dialog for purchasing custom usernames via PayPal, gift cards, or crypto, including payment proof upload and username validation.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states and error recovery.",
  "frontend/src/components/auth/LoginQueue.tsx": "Queue waiting screen with video background, countdown timer, progress bar, social media links, and option to skip queue for a fee.",
  "frontend/src/components/auth/QueueSkipDialog.tsx": "Dialog displaying payment methods (PayPal, UK gift cards, crypto) and a form for submitting payment proof to skip the login queue.",
  "frontend/src/components/auth/QueueSkipPaymentForm.tsx": "Form component for submitting queue-skip payment proof, supporting PayPal, UK gift cards (Amazon, Tesco, Starbucks), and cryptocurrency payment methods with transaction ID, screenshot upload, and gift card code validation.",
  "frontend/src/components/auth/TermsAcceptanceModal.tsx": "Modal dialog displaying terms and conditions that users must accept before account creation, emphasizing prohibition of hacking, scamming, and third-party selling activities.",
  "frontend/src/components/auth/UsernameSetup.tsx": "Empty file with no content.",
  "frontend/src/components/auth/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name and email, blocking interaction until profile setup is complete.",
  "frontend/src/components/cart/CartDrawer.tsx": "Side drawer component displaying shopping cart items with item count badge, scrollable list of cart items, and checkout navigation button.",
  "frontend/src/components/cart/CartItem.tsx": "Cart item component with product image, quantity controls (increment/decrement buttons and input), remove button, and subtotal calculation.",
  "frontend/src/components/checkout/PaymentMethodCard.tsx": "Card component displaying payment method details (title, description, payment address/ID) with a copy-to-clipboard button for easy payment information sharing.",
  "frontend/src/components/layout/Layout.tsx": "Main layout wrapper with sticky header containing logo, navigation (Store, Admin Panel), username display with regeneration button, cart drawer, login button, and footer with Caffeine.ai attribution.",
  "frontend/src/components/profile/UsernameRegenerationDialog.tsx": "Dialog component for username changes offering AI-generated usernames or custom usernames, displaying payment methods (PayPal, gift cards, crypto) and handling payment submission flow.",
  "frontend/src/components/profile/UsernameRegenerationPaymentForm.tsx": "Form component for submitting username change payment proof supporting PayPal, gift cards, and crypto, with file upload for screenshots and gift card code entry, then shows AI username generator on success.",
  "frontend/src/components/storefront/CategoryFilter.tsx": "Filter component displaying category buttons with icons and product counts, allowing users to filter products by category or view all products.",
  "frontend/src/components/storefront/ProductCard.tsx": "Card component displaying individual product details (image, name, price, stock) with add-to-cart functionality and authentication checks.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and providing login/logout functionality with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend API calls including user profiles, usernames, products, categories, cart operations, and payment submissions with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space, including primary, secondary, accent, destructive, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page with role-based access control that displays tabs for managing products, categories, payment config, queue skip submissions, username changes, and custom usernames. Shows access denied message for non-admin users.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that displays cart summary with product details and total, shows payment method options (card, gift card, crypto), and handles order completion by clearing the cart.",
  "frontend/src/pages/Storefront.tsx": "Main storefront page with hero banner, product grid with category filtering, product counts per category, and admin access button that verifies username-based admin privileges before navigation.",
  "frontend/src/utils/gamerTagGenerator.ts": "Utility function that generates random gaming usernames by combining adjectives/nouns/action words with 2-digit numbers in formats like 'ShadowWarrior42' or 'TigerStrike89'.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from both regular and hash-based routing, with sessionStorage persistence support and functions to store, retrieve, and clear parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for colors using OKLCH variables, container settings, border radius variables, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking for a digital gaming marketplace with admin-managed product listings, Internet Identity authentication, and manual payment processing (PayPal, gift cards, crypto). Features include login queue with countdown, AI-generated GamerTag usernames, multi-category product organization, shopping cart, and admin panel for managing products, categories, and payment configurations."
}