{
  "backend/main.mo": "Main backend actor implementing user profiles, product catalog, shopping cart, payment configuration, queue skip system, custom username submissions, and admin authorization using dual whitelist (username and phone number) with access control mixins and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: user-facing error messages in PhoneNumberSetup component and admin panel phone number addition error handling.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including authentication flow, admin panels, storefront, cart, checkout, and hooks with details on queue system, username generation, and unified admin authorization checks.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark theme variables using neutral grayscale tones with minimal color accents.",
  "frontend/index.html": "HTML entry point for the Digital Gaming Account Marketplace application with root div and module script reference.",
  "frontend/src/App.tsx": "Main app component orchestrating authentication flow with TanStack Router, managing login queue, terms acceptance, mandatory phone number setup for all users, AI username generation, and routing to storefront/admin/checkout pages.",
  "frontend/src/components/admin/CategoryForm.tsx": "Dialog form component for creating and editing product categories with name and description fields, using React Query mutations and toast notifications.",
  "frontend/src/components/admin/CategoryList.tsx": "Admin table component displaying all categories with edit and delete actions, confirmation dialogs, and empty state handling.",
  "frontend/src/components/admin/CustomUsernameSubmissionsList.tsx": "Admin component for viewing and managing custom username submissions with approve/reject actions, screenshot viewing, and payment method display. Fetches user profiles to display usernames alongside submissions and handles status badges.",
  "frontend/src/components/admin/PaymentConfigForm.tsx": "Admin form for configuring payment details including PayPal email, crypto wallet, gift card instructions, Instagram URL, and pricing for queue skip, username regeneration, and custom usernames. Also allows adding admin usernames and phone numbers.",
  "frontend/src/components/admin/ProductForm.tsx": "Dialog form component for creating and editing products with fields for name, description, type, price, quantity, category, and image upload. Handles image upload with progress tracking and uses ExternalBlob for image storage.",
  "frontend/src/components/admin/ProductList.tsx": "Admin table component displaying all products with edit and delete actions. Shows product image, name, type, category, price, and quantity with confirmation dialog for deletions.",
  "frontend/src/components/admin/QueueSkipSubmissionsList.tsx": "Admin component for viewing queue skip payment submissions with fraud flagging capability. Displays submission details including payment method (PayPal, gift card, or crypto), status badges, and timestamps sorted by most recent first.",
  "frontend/src/components/admin/UsernameChangeSubmissionsList.tsx": "Admin component that displays a table of username change payment submissions with status badges, gift card type labels, and fraud flagging functionality. Fetches and displays user profiles for each submission and allows admins to flag fraudulent entries.",
  "frontend/src/components/auth/AIUsernameGenerator.tsx": "Component that automatically generates and validates unique gamer tags using a generator utility, retrying on duplicates until a valid username is found. Provides option to switch to custom username dialog and completes onboarding after successful username creation.",
  "frontend/src/components/auth/CustomUsernameDialog.tsx": "Multi-step dialog for purchasing custom usernames through PayPal, gift cards, or cryptocurrency payment methods. Handles payment proof submission (transaction ID, screenshots, gift card codes) and username validation before creating the custom username.",
  "frontend/src/components/auth/LoginButton.tsx": "Simple authentication button component that toggles between login and logout states using Internet Identity. Handles authentication errors and clears query cache on logout.",
  "frontend/src/components/auth/LoginQueue.tsx": "Queue screen component with video background that displays a countdown position (randomly initialized between 20 seconds and 5 minutes) and offers a paid queue skip option. Includes social media links and completes when position reaches zero.",
  "frontend/src/components/auth/PhoneNumberSetup.tsx": "Modal dialog that requires users to enter and validate their phone number (digits only, no + prefix) for account verification. Handles duplicate phone number detection and displays specific error messages from the backend.",
  "frontend/src/components/auth/QueueSkipDialog.tsx": "Dialog component that displays payment methods (PayPal, UK Gift Card, Cryptocurrency) and a form for users to submit payment proof to skip the queue for a configurable price.",
  "frontend/src/components/auth/QueueSkipPaymentForm.tsx": "Form component for submitting queue skip payment proof with support for PayPal, gift cards (with code entry), and cryptocurrency, including file upload validation and transaction ID submission.",
  "frontend/src/components/auth/TermsAcceptanceModal.tsx": "Modal component that displays terms and conditions prohibiting hacking, scamming, and third-party selling, requiring user acceptance before account creation.",
  "frontend/src/components/auth/UsernameSetup.tsx": "Empty file with no content.",
  "frontend/src/components/auth/UserProfileSetup.tsx": "Dialog component that prompts authenticated users without a profile to enter their name and email during initial setup.",
  "frontend/src/components/cart/CartDrawer.tsx": "Side sheet component that displays cart items with item count badge, allows navigation to checkout, and shows empty state when cart is empty.",
  "frontend/src/components/cart/CartItem.tsx": "Cart item component displaying product image, name, price, and quantity controls with increment/decrement buttons and remove functionality.",
  "frontend/src/components/checkout/PaymentMethodCard.tsx": "Card component that displays payment method details with icon, description, and a copy-to-clipboard button for payment information.",
  "frontend/src/components/layout/Layout.tsx": "Main layout component with header navigation (store, admin panel), username display with regeneration button, cart drawer, login button, and footer with Caffeine.ai attribution.",
  "frontend/src/components/profile/UsernameRegenerationDialog.tsx": "Dialog component for changing usernames, offering AI-generated usernames for a fee or custom usernames at a higher price, with payment options including PayPal, UK gift cards, and cryptocurrency.",
  "frontend/src/components/profile/UsernameRegenerationPaymentForm.tsx": "Form component for submitting payment proof for username regeneration, supporting PayPal, gift cards, and crypto payments with transaction ID and screenshot/code validation, then showing an AI username generator on success.",
  "frontend/src/components/storefront/CategoryFilter.tsx": "Filter component displaying category buttons with icons and product counts, allowing users to filter products by category or view all products.",
  "frontend/src/components/storefront/ProductCard.tsx": "Card component displaying product details (image, name, description, price, stock) with an add-to-cart button that requires authentication and handles out-of-stock states.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with an admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/usePhoneNumber.ts": "React Query hooks for checking if a user has a phone number saved and for saving/validating phone numbers, with frontend validation to ensure digits-only format without the + prefix.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API interactions including user profiles, usernames, products, categories, cart operations, payments, admin functions, and submission management. Handles query caching, mutations, and invalidation logic.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using OKLCH color space. Defines design tokens for backgrounds, foregrounds, borders, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page with role-based access control that displays tabs for managing products, categories, payment config, queue skip submissions, username changes, and custom username requests. Shows access denied message for non-admin users.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that displays cart summary with product details and total, shows available payment methods (card, gift card, crypto), and handles order completion by clearing the cart.",
  "frontend/src/pages/Storefront.tsx": "Main storefront page with hero banner, category filtering, product grid display, and social media links. Includes admin panel access button for authorized users with role verification.",
  "frontend/src/utils/gamerTagGenerator.ts": "Utility function that generates random gaming usernames by combining adjectives/nouns/action words with 2-digit numbers in formats like 'ShadowWarrior42' or 'TigerStrike89'.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, custom animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing a digital gaming marketplace with admin-managed product listings, Internet Identity authentication, multiple payment methods, AI-generated usernames, and phone number requirements, currently experiencing admin panel access and data loading issues."
}