{
  "backend/main.mo": "Main backend actor implementing a digital gaming marketplace with user profiles, products, categories, shopping cart, payment configuration, queue skip system, custom username submissions, and admin authorization using mixins for storage and access control.",
  "backend/migration.mo": "Migration module that clones the admin username whitelist and adds 'venomgladiator25' during actor upgrades.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend components including authentication flow, storefront, admin panel, cart, checkout, and various modals for user onboarding.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes using neutral grayscale tones.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Digital Gaming Account Marketplace.",
  "frontend/src/App.tsx": "Root application component orchestrating authentication flow with login queue, terms acceptance, AI username generator, and TanStack Router setup for storefront, admin, and checkout routes.",
  "frontend/src/components/admin/CategoryForm.tsx": "Dialog form component for creating and editing categories with name and description fields, using React Query mutations and toast notifications.",
  "frontend/src/components/admin/CategoryList.tsx": "Admin table component displaying all categories with edit and delete actions, confirmation dialog for deletion, and integration with CategoryForm modal.",
  "frontend/src/components/admin/CustomUsernameSubmissionsList.tsx": "Admin component for reviewing custom username payment submissions with approve/reject actions, screenshot viewing, and status badges for PayPal, crypto, and gift card payments.",
  "frontend/src/components/admin/PaymentConfigForm.tsx": "Admin form component for configuring payment methods (PayPal, crypto, gift cards, Instagram) and pricing for queue skip, username regeneration, and custom username features.",
  "frontend/src/components/admin/ProductForm.tsx": "Dialog form component for creating and editing products with fields for name, description, type, price, quantity, category, and image upload with progress tracking.",
  "frontend/src/components/admin/ProductList.tsx": "Admin table component displaying all products with image thumbnails, details, and actions for editing and deleting products with confirmation dialogs.",
  "frontend/src/components/admin/QueueSkipSubmissionsList.tsx": "Admin component for reviewing queue skip payment submissions (PayPal, gift cards, crypto) with fraud flagging capability and status badges, sorted by timestamp.",
  "frontend/src/components/admin/UsernameChangeSubmissionsList.tsx": "Admin component that displays a table of username change payment submissions with status badges, payment details, and actions to flag fraudulent submissions.",
  "frontend/src/components/auth/AIUsernameGenerator.tsx": "Component that automatically generates and validates unique gamer tags using AI, retrying on duplicates, with an option to switch to custom username creation.",
  "frontend/src/components/auth/CustomUsernameDialog.tsx": "Multi-step dialog for purchasing custom usernames, handling payment method selection (PayPal/gift card/crypto), payment proof upload, and username validation.",
  "frontend/src/components/auth/LoginButton.tsx": "Simple authentication button component that toggles between login and logout states using Internet Identity, with loading states and error handling.",
  "frontend/src/components/auth/LoginQueue.tsx": "Queue waiting screen with video background, countdown timer, progress bar, and option to skip queue for a fee, plus social media links.",
  "frontend/src/components/auth/QueueSkipDialog.tsx": "Dialog displaying payment methods (PayPal, UK gift cards, cryptocurrency) and a form for submitting payment proof to skip the login queue.",
  "frontend/src/components/auth/QueueSkipPaymentForm.tsx": "Form component for submitting queue-skip payment proof, supporting PayPal, UK gift cards (Amazon, Tesco, Starbucks), and cryptocurrency with transaction ID, screenshot upload, and gift card code validation.",
  "frontend/src/components/auth/TermsAcceptanceModal.tsx": "Modal dialog displaying terms and conditions that users must accept before account creation, emphasizing prohibition of hacking, scamming, and third-party selling.",
  "frontend/src/components/auth/UsernameSetup.tsx": "Empty file with no content.",
  "frontend/src/components/auth/UserProfileSetup.tsx": "Modal dialog for authenticated users to set up their initial profile with name and email fields, shown when user profile is null.",
  "frontend/src/components/cart/CartDrawer.tsx": "Side sheet drawer displaying shopping cart items with item count badge, scrollable list of cart items, and checkout button.",
  "frontend/src/components/cart/CartItem.tsx": "Cart item component displaying product image, name, price, quantity controls (increment/decrement/input), remove button, and calculated subtotal.",
  "frontend/src/components/checkout/PaymentMethodCard.tsx": "Card component displaying payment method details (title, description, payment address/ID) with a copy-to-clipboard button.",
  "frontend/src/components/layout/Layout.tsx": "Main layout wrapper with sticky header containing logo, navigation links (Store, Admin Panel), username display with regeneration button, cart drawer, login button, and footer with Caffeine.ai attribution.",
  "frontend/src/components/profile/UsernameRegenerationDialog.tsx": "Dialog component for changing usernames with two options: AI-generated username regeneration (£0.01) and custom username selection (£0.10), displaying payment methods (PayPal, gift cards, crypto) and handling payment submission flow.",
  "frontend/src/components/profile/UsernameRegenerationPaymentForm.tsx": "Form component for submitting username change payment proof, supporting PayPal, gift cards, and cryptocurrency payment methods with transaction ID, screenshot upload, and gift card code inputs, then showing AI username generator on success.",
  "frontend/src/components/storefront/CategoryFilter.tsx": "Filter component displaying category buttons (All Products, Account, Currency, Clothes) with icons and product counts, allowing users to filter products by category.",
  "frontend/src/components/storefront/ProductCard.tsx": "Card component displaying individual product details (image, name, description, price, quantity) with an 'Add to Cart' button that requires authentication and handles out-of-stock states.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing with admin token and invalidating dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend API calls including user profiles, usernames, products, categories, cart operations, orders, payments, and admin functions, all using the actor instance and managing cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space, including primary, secondary, accent, destructive, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page with role-based access control that displays tabs for managing products, categories, payment config, queue skip submissions, username changes, and custom usernames.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that displays cart summary with product details and total, shows payment method options (card, gift card, crypto), and handles order completion by clearing the cart.",
  "frontend/src/pages/Storefront.tsx": "Main storefront page displaying hero banner, product grid with category filtering, product counts per category, and admin access button for authenticated users with admin privileges.",
  "frontend/src/utils/gamerTagGenerator.ts": "Utility function that generates random gaming usernames by combining adjectives/nouns/action words with 2-digit numbers in formats like 'ShadowWarrior42' or 'TigerStrike89'.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from both regular and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, container settings, border radius variables, custom animations, and typography/container-queries plugins.",
  "project_state.json": "Project state tracking file for a digital gaming marketplace with admin-managed product listings, Internet Identity authentication, and manual payment processing. Includes architectural notes, existing features (authentication, admin panel, storefront, cart, checkout, payment config, categories, login queue, social links, AI username generation), and requirement tracking."
}