{
  "backend/main.mo": "Main backend actor implementing user profiles, username management with profanity filtering, product/category management, shopping cart, payment configuration, and queue skip/username regeneration submission systems with access control.",
  "backend/migration.mo": "Migration module that adds usernameRegenerationPriceGBP field to PaymentConfig, transforming OldActor state to NewActor state with default value of 0.01.",
  "feature_evidence.json": "Feature evidence report documenting implementation of terms acceptance modal, AI-generated GamerTag username creation, username regeneration with £0.01 payment, and admin review panels with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including authentication flow, layout, cart, storefront, admin panels, checkout, and custom hooks for backend operations.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark theme variables using neutral tones with accent colors for gaming aesthetic.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Digital Gaming Account Marketplace application.",
  "frontend/src/App.tsx": "Main React application with TanStack Router setup, orchestrating authentication flow through login queue, terms acceptance, AI username generation, and routing to storefront, admin, and checkout pages.",
  "frontend/src/components/admin/CategoryForm.tsx": "Dialog form component for creating and editing categories with name and description fields, using React Query mutations and toast notifications.",
  "frontend/src/components/admin/CategoryList.tsx": "Table component displaying all categories with edit and delete actions, includes confirmation dialog for deletions and integrates CategoryForm for editing.",
  "frontend/src/components/admin/PaymentConfigForm.tsx": "Card form component for configuring payment methods (PayPal, gift cards, crypto) and pricing settings (queue skip and username regeneration prices) with URL validation.",
  "frontend/src/components/admin/ProductForm.tsx": "Dialog form for creating and updating products with fields for name, description, type, price, quantity, category, and image upload with progress tracking using ExternalBlob.",
  "frontend/src/components/admin/ProductList.tsx": "Table component displaying all products with image thumbnails, type badges, and edit/delete actions, includes confirmation dialog for deletions and integrates ProductForm.",
  "frontend/src/components/admin/QueueSkipSubmissionsList.tsx": "Table component for reviewing queue skip payment submissions with status badges, payment method details (PayPal/gift card/crypto), screenshot viewing, and fraud flagging functionality.",
  "frontend/src/components/admin/UsernameChangeSubmissionsList.tsx": "Admin component that displays a table of username change payment submissions with status badges, payment details, and actions to flag fraudulent submissions.",
  "frontend/src/components/auth/AIUsernameGenerator.tsx": "Component that automatically generates and validates unique gamer tags using a local generator, retrying until a valid username is found and created.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component that handles Internet Identity authentication, toggling between login and logout states with loading indicators.",
  "frontend/src/components/auth/LoginQueue.tsx": "Queue screen with video background that displays a countdown timer (20s-5min) and offers a paid queue skip option with social media links.",
  "frontend/src/components/auth/QueueSkipDialog.tsx": "Dialog that displays payment method options (PayPal, UK gift cards, cryptocurrency) and embeds the payment proof submission form for queue skipping.",
  "frontend/src/components/auth/QueueSkipPaymentForm.tsx": "Form component for submitting queue skip payment proof, supporting PayPal/crypto screenshots or UK gift card codes with validation and file upload.",
  "frontend/src/components/auth/TermsAcceptanceModal.tsx": "Modal dialog that displays terms and conditions prohibiting hacking, scamming, and third-party selling, requiring user acceptance to proceed.",
  "frontend/src/components/auth/UsernameSetup.tsx": "Empty file with no content.",
  "frontend/src/components/auth/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name and email, blocking interaction until completed.",
  "frontend/src/components/cart/CartDrawer.tsx": "Side drawer component displaying shopping cart items with item count badge, scrollable list, and checkout button.",
  "frontend/src/components/cart/CartItem.tsx": "Individual cart item component with product image, quantity controls (increment/decrement/input), remove button, and subtotal calculation.",
  "frontend/src/components/checkout/PaymentMethodCard.tsx": "Reusable card component displaying payment method details (PayPal, gift card, crypto) with copy-to-clipboard functionality.",
  "frontend/src/components/layout/Layout.tsx": "Main application layout with sticky header (logo, navigation, cart, login), footer with Caffeine.ai attribution, and modals for profile setup and username regeneration.",
  "frontend/src/components/profile/UsernameRegenerationDialog.tsx": "Dialog for purchasing username regeneration showing current username, payment methods (PayPal, gift card, crypto), and payment submission form.",
  "frontend/src/components/profile/UsernameRegenerationPaymentForm.tsx": "Form for submitting username change payment proof with payment method selection, transaction ID, screenshot upload for PayPal/crypto, or gift card code entry, then shows AI username generator on success.",
  "frontend/src/components/storefront/CategoryFilter.tsx": "Category filter buttons with icons and product counts, allowing users to filter products by category or view all.",
  "frontend/src/components/storefront/ProductCard.tsx": "React component that displays a product card with image, name, description, price, stock status, and an add-to-cart button that requires authentication.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializing access control with an admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and providing login/logout functionality using the DFINITY auth client.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for managing backend data operations including user profiles, products, categories, cart items, payment configs, and admin submissions with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a complete design system for light and dark themes including colors for backgrounds, foregrounds, borders, and chart elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard page with role-based access control, featuring tabbed interface for managing products, categories, payment settings, queue skip submissions, and username change requests.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that displays cart summary with product details and total, shows payment method options, and handles order completion by clearing the cart after payment instructions are shown.",
  "frontend/src/pages/Storefront.tsx": "Main storefront page component displaying hero banner, category filters, product grid with filtering by game category, and social media links (YouTube/Instagram) at the bottom.",
  "frontend/src/utils/gamerTagGenerator.ts": "Generates random gaming-themed usernames in PascalCase format (e.g., ShadowWarrior42) by combining adjectives/nouns/action words with 2-digit numbers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings, container queries, typography plugin, and custom animations.",
  "project_state.json": "Project metadata defining a gaming marketplace with admin-managed products, Internet Identity authentication, multi-payment methods, AI-generated usernames, and login queue system."
}