{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix user not found error when adding phone numbers to existing accounts",
  "requirements": [
    {
      "id": "REQ-92",
      "summary": "Add user-facing error messages in the PhoneNumberSetup component to clearly display backend errors when phone number saving fails",
      "acceptanceCriteria": [
        "Display specific error messages for 'user not found' errors",
        "Display specific error messages for 'phone number already in use' errors",
        "Show a generic error message for unexpected errors",
        "Error messages are displayed prominently in the PhoneNumberSetup dialog",
        "Users can retry phone number submission after seeing error messages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/PhoneNumberSetup.tsx",
          "operation": "modify",
          "description": "Add error state and error message display above the phone number input field. Parse backend error responses from useSavePhoneNumber mutation to detect 'user not found' errors and 'phone number already in use' errors, displaying specific user-friendly messages for each case. Show a generic error message for unexpected errors. Ensure the dialog remains open after errors so users can retry submission. Use Alert component from shadcn/ui to display error messages prominently."
        }
      ]
    },
    {
      "id": "REQ-93",
      "summary": "Verify the admin panel phone number addition functionality properly handles existing users and displays appropriate errors",
      "acceptanceCriteria": [
        "When admins add phone numbers to the whitelist through PaymentConfigForm, the backend properly validates the phone number exists in user records",
        "If the phone number doesn't belong to any existing user, display a clear error message",
        "The admin panel shows success confirmation when phone numbers are successfully added to the whitelist"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/PaymentConfigForm.tsx",
          "operation": "modify",
          "description": "Add error handling to the addAdminPhoneNumber mutation in the handleAddAdminPhoneNumber function. Parse backend error responses to detect validation failures when the phone number doesn't belong to any existing user. Display specific error messages using toast notifications when phone number validation fails. Maintain the existing success toast when phone numbers are successfully added to the whitelist."
        }
      ]
    }
  ]
}