{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Expand phone number support to worldwide format and add phone number update functionality",
  "requirements": [
    {
      "id": "REQ-86",
      "summary": "Update PhoneNumberSetup component to accept worldwide numeric phone numbers without length restrictions or '+' prefix",
      "acceptanceCriteria": [
        "Phone number input field accepts any numeric characters without length restrictions",
        "No country-specific validation is enforced",
        "Plus sign (+) prefix is not allowed in the input",
        "Non-numeric characters are rejected"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/PhoneNumberSetup.tsx",
          "operation": "modify",
          "description": "Remove the 11-digit UK phone number validation and replace with worldwide numeric validation that accepts any length. Update the input validation to reject '+' prefix and non-numeric characters while allowing any length numeric input. Update error messages to reflect worldwide format requirements. Keep the existing form structure and submission flow intact."
        }
      ]
    },
    {
      "id": "REQ-88",
      "summary": "Add 'Haven't Added Phone Number' button to PhoneNumberSetup dialog to allow users to proceed with phone number entry",
      "acceptanceCriteria": [
        "Button is visible within the PhoneNumberSetup dialog",
        "Button labeled 'Haven't Added Phone Number' or similar clear text",
        "Clicking the button allows users to proceed with phone number entry in the same dialog",
        "Button provides an explicit action for users to add their phone number"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/PhoneNumberSetup.tsx",
          "operation": "modify",
          "description": "Add a 'Haven't Added Phone Number' button to the dialog that allows users to proceed with entering their phone number. Position the button prominently within the dialog interface, ensuring it's clear that clicking it enables the phone number entry flow. The button should maintain the same dialog context and allow users to input their phone number without dismissing the modal."
        }
      ]
    },
    {
      "id": "REQ-89",
      "summary": "Update App.tsx authentication flow to require phone number from all users on login, blocking app access until provided",
      "acceptanceCriteria": [
        "All authenticated users without a phone number are prompted with PhoneNumberSetup dialog",
        "Both new users and existing users (who created accounts before phone requirement) are required to add phone number on login",
        "Users cannot access any app features until phone number is provided",
        "Phone number check occurs after terms acceptance and before other features"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the authentication flow to check if the user has a phone number after terms acceptance. Add a phone number check gate that displays the PhoneNumberSetup dialog for all authenticated users (both new and existing) who haven't provided a phone number. Ensure this check occurs after terms acceptance but before the AI username generator and main routes. Block access to all app features until the phone number is saved. Use the existing usePhoneNumber hook to check hasPhoneNumber status and integrate the PhoneNumberSetup component into the sequential gate flow."
        },
        {
          "path": "frontend/src/hooks/usePhoneNumber.ts",
          "operation": "modify",
          "description": "Review and ensure the usePhoneNumber hook properly supports the updated phone number validation requirements. Verify that the savePhoneNumber mutation correctly handles worldwide numeric phone numbers without length restrictions. Ensure proper error handling and cache invalidation after successful phone number submission."
        }
      ]
    }
  ]
}