{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace manual username creation with AI-generated GamerTags and terms acceptance",
  "requirements": [
    {
      "id": "REQ-37",
      "summary": "Create terms acceptance modal that displays after queue completion or skip payment, requiring user to accept before proceeding",
      "acceptanceCriteria": [
        "Terms modal appears immediately after queue countdown reaches zero or after successful queue skip payment submission",
        "Modal displays the exact text: 'We at Game Vault have no partition with any hacking or scamming or 3rd party selling'",
        "Modal includes an Accept button that user must click to proceed",
        "Modal blocks all other interactions until Accept is clicked",
        "After clicking Accept, user proceeds to AI username generation flow"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/TermsAcceptanceModal.tsx",
          "operation": "create",
          "description": "Create a modal component that displays terms text with an Accept button. Modal should block all interactions (no close button, no backdrop dismiss) until Accept is clicked. After acceptance, trigger navigation to AI username generation flow. Use shadcn/ui Dialog component with locked state."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update authentication flow to show TermsAcceptanceModal after queue completion or queue skip payment approval. Replace the current flow that shows UsernameSetup directly after hasQueueBypass with terms acceptance first. Add state to track terms acceptance completion before proceeding to username generation."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Implement AI-generated GamerTag-style username creation that automatically generates usernames immediately after terms acceptance",
      "acceptanceCriteria": [
        "After terms acceptance, AI automatically generates a GamerTag-style username",
        "Username follows pattern: adjective/noun + noun/action word + 2-digit number (e.g., ShadowWarrior42, EpicSniper89)",
        "Generated username is validated against backend rules (unique, alphanumeric, profanity filter)",
        "If validation fails, AI automatically generates a new username until one passes validation",
        "User is not shown manual input field or asked to create their own username",
        "Once valid username is generated, user proceeds to storefront access"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/AIUsernameGenerator.tsx",
          "operation": "create",
          "description": "Create a component that automatically generates GamerTag-style usernames using client-side word lists (adjectives, nouns, action words). Generate format: word1 + word2 + random 2-digit number (e.g., ShadowWarrior42). Automatically call backend validateGeneratedUsername to check uniqueness and profanity. If validation fails, regenerate and retry until successful. Show loading state with generated username being validated. Once valid, automatically call createUsername and proceed to storefront. No manual input fields."
        },
        {
          "path": "frontend/src/utils/gamerTagGenerator.ts",
          "operation": "create",
          "description": "Create utility module with word lists for GamerTag generation. Include arrays of gaming-themed adjectives (Shadow, Epic, Dark, Cyber, etc.), nouns (Warrior, Sniper, Knight, Dragon, etc.), and action words. Export generateGamerTag function that randomly combines words with 2-digit number suffix. Ensure PascalCase formatting for generated names."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update authentication flow to show AIUsernameGenerator after terms acceptance is completed. Remove direct navigation to UsernameSetup. Wire AIUsernameGenerator to trigger after TermsAcceptanceModal acceptance. Once username is successfully created, proceed to storefront."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Add username regeneration feature allowing users to request new AI-generated GamerTag for £0.01 per change",
      "acceptanceCriteria": [
        "User profile UI displays option to regenerate username with £0.01 price",
        "Clicking regenerate opens payment flow identical to queue skip payment (PayPal, UK gift cards, crypto)",
        "Payment submission includes proof (screenshot/transaction ID for PayPal and crypto, gift card code for gift cards)",
        "Upon successful payment submission, new GamerTag is automatically generated and assigned",
        "Backend stores username change payment submissions for admin review",
        "User can regenerate username unlimited times, paying £0.01 each time"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/profile/UsernameRegenerationDialog.tsx",
          "operation": "create",
          "description": "Create dialog component for username regeneration that displays current username and £0.01 price. Include payment method selection (PayPal, UK gift cards, crypto) identical to QueueSkipDialog structure. Embed UsernameRegenerationPaymentForm for proof submission. After successful payment submission, automatically trigger AIUsernameGenerator to create and assign new username. Use shadcn/ui Dialog component."
        },
        {
          "path": "frontend/src/components/profile/UsernameRegenerationPaymentForm.tsx",
          "operation": "create",
          "description": "Create payment proof submission form for username regeneration. Mirror QueueSkipPaymentForm structure with PayPal transaction ID, gift card code entry, and crypto screenshot upload fields. Call backend submitUsernameChangePayment with proof details. Handle success state to trigger username regeneration flow. Include validation and error handling."
        },
        {
          "path": "frontend/src/components/layout/Layout.tsx",
          "operation": "modify",
          "description": "Add username regeneration button to user profile section in header (near login button). Display current username and regeneration option for authenticated users. Wire button to open UsernameRegenerationDialog. Ensure button is only visible to authenticated users with existing usernames."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useSubmitUsernameChangePayment mutation hook that calls backend submitUsernameChangePayment with transaction details. Add useGetUsernameChangePriceGBP query hook to fetch username regeneration price from payment config. Invalidate relevant caches on successful submission."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Add username regeneration price configuration field in admin payment settings panel",
      "acceptanceCriteria": [
        "Admin payment configuration panel includes 'Username Change Price' field",
        "Default value is set to £0.01",
        "Admin can modify the username change price",
        "Updated price is displayed in username regeneration UI",
        "Backend validates and persists the configured username change price"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/PaymentConfigForm.tsx",
          "operation": "modify",
          "description": "Add 'Username Change Price (GBP)' input field to payment configuration form alongside queueSkipPriceGBP. Bind to usernameRegenerationPriceGBP field from PaymentConfig type. Include numeric validation and default value of 0.01. Update form submission to include username regeneration price in payload."
        },
        {
          "path": "frontend/src/components/profile/UsernameRegenerationDialog.tsx",
          "operation": "modify",
          "description": "Update price display to fetch from backend payment config using useGetUsernameChangePriceGBP hook. Replace hardcoded £0.01 with dynamic price value. Show loading state while fetching price."
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Create admin panel section to review username change payment submissions with fraud flagging capability",
      "acceptanceCriteria": [
        "Admin panel displays list of all username change payment submissions",
        "Each submission shows: user principal, timestamp, payment method, transaction ID, and status",
        "For PayPal and crypto submissions, screenshot is displayed",
        "For gift card submissions, gift card type and code are displayed",
        "Admin can flag submissions as fraudulent",
        "Flagged submissions prevent the user from future username regeneration"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/UsernameChangeSubmissionsList.tsx",
          "operation": "create",
          "description": "Create admin component that displays table of username change payment submissions. Show columns: user principal (truncated), timestamp, payment method, transaction ID, gift card type/code, status badge, and flag action button. Use useGetUsernameChangeSubmissions query hook for data. Include flag fraud action using useFlagUsernameChangeFraud mutation. Display PayPal/crypto screenshots inline when available. Apply same styling as QueueSkipSubmissionsList."
        },
        {
          "path": "frontend/src/pages/AdminPanel.tsx",
          "operation": "modify",
          "description": "Add 'Username Changes' tab to admin panel tabs alongside Products, Categories, Payment Settings, and Queue Skip Submissions. Wire tab to render UsernameChangeSubmissionsList component. Ensure tab is only visible to admin users."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useGetUsernameChangeSubmissions query hook that calls backend getUsernameChangeSubmissions. Add useFlagUsernameChangeFraud mutation hook that calls backend flagUsernameChangeFraud with user principal. Invalidate submissions cache on successful flag action."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Remove manual username creation modal and update authentication flow to use terms acceptance followed by AI username generation",
      "acceptanceCriteria": [
        "UsernameSetup.tsx component is no longer rendered in authentication flow",
        "App.tsx routes users from queue completion/skip directly to terms acceptance modal",
        "After terms acceptance, AI username generation flow is triggered",
        "No manual username input fields are shown to users",
        "Username creation flow is fully automated after terms acceptance"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/UsernameSetup.tsx",
          "operation": "delete",
          "description": "Remove the UsernameSetup component file as manual username creation is being replaced by automated AI generation."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove all references to UsernameSetup component and its usage. Update authentication flow logic to sequence: 1) Queue completion/skip → 2) TermsAcceptanceModal → 3) AIUsernameGenerator → 4) Storefront access. Remove manual username creation flow entirely. Update state management to track terms acceptance and AI username generation completion."
        }
      ]
    }
  ]
}