{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add animated gaming background to queue and social media links",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Add animated gaming video background to the login queue screen",
      "acceptanceCriteria": [
        "Video background displays animated gaming-style visuals behind the queue countdown",
        "Animation loops seamlessly without disrupting the queue UI elements",
        "Video is optimized for web performance"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/LoginQueue.tsx",
          "operation": "modify",
          "description": "Add video background element using the generated gaming-background.mp4 file from frontend/public/assets/generated/gaming-background.dim_1920x1080.mp4. Position the video as a full-screen background layer behind the queue UI elements with autoplay, loop, and muted attributes. Ensure the queue countdown and progress UI remain visible and interactive above the video layer with appropriate z-index and overlay styling."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Add YouTube and Instagram social media icons to the bottom of the LoginQueue component",
      "acceptanceCriteria": [
        "YouTube and Instagram icons appear at the bottom of the queue screen",
        "YouTube icon links to https://youtube.com/@fros7yyt?si=u4-j8LrTkNuj7wUo",
        "Instagram icon links to a URL that can be configured",
        "Icons are styled consistently with the gaming theme",
        "Links open in a new tab"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/LoginQueue.tsx",
          "operation": "modify",
          "description": "Add a social media links section at the bottom of the queue component with YouTube and Instagram icons. YouTube icon links to https://youtube.com/@fros7yyt?si=u4-j8LrTkNuj7wUo. Instagram icon uses the useGetInstagramUrl hook to fetch the configurable URL from the backend. Use lucide-react icons (Youtube, Instagram) styled with gaming theme colors. Links open in new tabs with target='_blank' and rel='noopener noreferrer'. Position the icons with flexbox layout and appropriate spacing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useGetInstagramUrl query hook that calls actor.getInstagramUrl() to fetch the Instagram URL from the backend. Follow the existing pattern of other query hooks in the file with proper error handling and enabled condition checking for actor availability."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Add YouTube and Instagram social media icons to the bottom of the storefront page",
      "acceptanceCriteria": [
        "YouTube and Instagram icons appear at the bottom of the store page",
        "YouTube icon links to https://youtube.com/@fros7yyt?si=u4-j8LrTkNuj7wUo",
        "Instagram icon links to a URL that can be configured",
        "Icons are styled consistently with the gaming theme",
        "Links open in a new tab"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Storefront.tsx",
          "operation": "modify",
          "description": "Add a social media links section at the bottom of the storefront page (after the product grid) with YouTube and Instagram icons. YouTube icon links to https://youtube.com/@fros7yyt?si=u4-j8LrTkNuj7wUo. Instagram icon uses the useGetInstagramUrl hook to fetch the configurable URL. Use lucide-react icons (Youtube, Instagram) styled consistently with the gaming theme and matching the implementation in LoginQueue. Links open in new tabs with target='_blank' and rel='noopener noreferrer'. Style with appropriate spacing and alignment at the page bottom."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Add Instagram URL field to the payment configuration form in the admin panel",
      "acceptanceCriteria": [
        "Instagram URL field appears in the PaymentConfigForm alongside other payment settings",
        "Admins can input and update the Instagram URL",
        "Instagram URL is stored in the backend",
        "Instagram icon on queue and store pages uses the configured URL",
        "Form validates that the Instagram URL is a valid URL format"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/PaymentConfigForm.tsx",
          "operation": "modify",
          "description": "Add an Instagram URL input field to the payment configuration form using the existing form structure and shadcn/ui components. The field displays and updates the instagramUrl property from the PaymentConfig interface (already present in backend.d.ts). Add URL validation using the form's validation schema to ensure proper URL format. Position the field logically within the existing payment settings layout. The form already handles the complete PaymentConfig object including instagramUrl, so only UI changes are needed."
        }
      ]
    }
  ]
}