{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin panel authorization for whitelisted usernames",
  "requirements": [
    {
      "id": "REQ-61",
      "summary": "Update the admin authorization check in the Storefront component to properly verify whitelisted usernames against the authenticated user's stored username, ensuring whitelisted users can access the admin panel",
      "acceptanceCriteria": [
        "Whitelisted users 'venomgladiator25' and 'turbohunter64' can click the admin button on the storefront",
        "These users are immediately navigated to the admin panel without seeing any authorization error",
        "Non-whitelisted users continue to see the 'no authorised access' message as expected",
        "The authorization check properly queries the backend whitelist and matches against the user's stored username"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Storefront.tsx",
          "operation": "modify",
          "description": "Fix the admin button click handler to properly retrieve the current user's username from their UserProfile (via getCallerUserProfile) and pass it to the isAdminUsername backend check. Currently the code is checking admin access incorrectly, causing whitelisted users to see the authorization error. Update the handleAdminClick function to: 1) Fetch the user's profile to get their username field, 2) Call isAdminUsername with that username to verify whitelist membership, 3) Navigate to /admin only if the check returns true, 4) Show appropriate error message if username is not whitelisted or profile is incomplete."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook useIsAdminUsername that accepts a username parameter and calls the backend isAdminUsername method. This hook should be disabled when username is null/undefined. Include proper query key structure ['isAdminUsername', username] for cache management. This hook will be used by the Storefront component to verify admin access for whitelisted usernames."
        }
      ]
    }
  ]
}