{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix custom username display in profile area",
  "requirements": [
    {
      "id": "REQ-64",
      "summary": "Update Layout component to display custom username when available, falling back to AI-generated username",
      "acceptanceCriteria": [
        "Profile area displays custom username for users who have paid £0.10 for custom usernames",
        "Profile area displays AI-generated username only when no custom username exists",
        "Username display updates immediately after custom username creation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Layout.tsx",
          "operation": "modify",
          "description": "Update the username display logic in the profile area to show userProfile.username (custom username) when it exists, falling back to the username from useGetUsername (AI-generated) only when userProfile.username is not present. Ensure the display updates reactively when the profile changes."
        }
      ]
    },
    {
      "id": "REQ-65",
      "summary": "Update useProfile query hook to fetch and cache custom username field",
      "acceptanceCriteria": [
        "Profile query returns custom username when available",
        "Query cache invalidates after custom username submission approval"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update useGetCallerUserProfile to ensure it properly fetches the username field from the UserProfile type returned by the backend. Add query invalidation in useSubmitCustomUsername mutation's onSuccess callback to refresh the profile cache after custom username submission."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the UserProfile interface to explicitly document that the username field contains the custom username when present, ensuring TypeScript types match the backend response structure."
        }
      ]
    },
    {
      "id": "REQ-66",
      "summary": "Update Storefront component to show custom username instead of AI-generated username",
      "acceptanceCriteria": [
        "Storefront page displays custom username in all username references when user has paid for custom username",
        "Admin authorization check uses custom username for whitelist verification when available"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Storefront.tsx",
          "operation": "modify",
          "description": "Update the admin panel access check to use userProfile.username (custom username) when available for isAdminUsername verification, falling back to the AI-generated username only when no custom username exists. Ensure the username displayed in any welcome messages or user references also prioritizes custom username over AI-generated username."
        }
      ]
    }
  ]
}